NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_net_beacon.c
void test_pkt_in_multi(void)
{
    setup_module();

    /* This is stupid, but we need individual storage of the same beacon+auth
     * multiple times for lookup into our own beacons, as they'll hold
     * different tx info pointers. */
    net_beacon_sample_data_t stored_beacons[] =
    {
        SEC_NET_SAMPLE_DATA_1,
        SEC_NET_SAMPLE_DATA_1,
        SEC_NET_SAMPLE_DATA_1
    };
    /* Invalidate the second auth, making this one fail verification. */
    memset(stored_beacons[1].auth, 0x56, NRF_MESH_KEY_SIZE);

    /* Yield 3 networks on lookup with NET ID */
    nrf_mesh_beacon_info_t * p_info[] =
    {
        &stored_beacons[0].info,
        &stored_beacons[1].info,
        &stored_beacons[2].info
    };
    nrf_mesh_beacon_tx_info_t tx_infos[ARRAY_SIZE(p_info)];
    memset(tx_infos, 0, sizeof(tx_infos));
    for (uint32_t j = 0; j < ARRAY_SIZE(p_info); j++)
    {
        p_info[j]->p_tx_info = &tx_infos[j];
    }

    mpp_infos = p_info;
    m_info_count = ARRAY_SIZE(p_info);

    net_beacon_sample_data_t sample_data = SEC_NET_SAMPLE_DATA_1;

    nrf_mesh_evt_t evt[ARRAY_SIZE(p_info)];

    mp_expected_net_id = sample_data.info.secmat.net_id;

    m_info_index = 0;
    for (uint32_t j = 0; j < ARRAY_SIZE(p_info); j++)
    {
        enc_aes_cmac_ExpectWithArray(p_info[j]->secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(stored_beacons[j].auth, 16);

        /* Only the valid auths should generate an event: */
        if (j != 1)
        {
            evt[j].type                                = NRF_MESH_EVT_NET_BEACON_RECEIVED;
            evt[j].params.net_beacon.p_rx_metadata     = NULL;
            evt[j].params.net_beacon.iv_index          = sample_data.iv_index;
            evt[j].params.net_beacon.flags.iv_update   = sample_data.iv_update;
            evt[j].params.net_beacon.flags.key_refresh = sample_data.key_refresh;
            evt[j].params.net_beacon.p_beacon_info   = p_info[j];
            evt[j].params.net_beacon.p_beacon_secmat = &p_info[j]->secmat;
            event_handle_Expect(&evt[j]);
        }
    }
    net_beacon_packet_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
    TEST_ASSERT_EQUAL(1, tx_infos[0].rx_count[0]);
    TEST_ASSERT_EQUAL(0, tx_infos[1].rx_count[0]); /* Had invalid auth, didn't get a match */
    TEST_ASSERT_EQUAL(1, tx_infos[2].rx_count[0]);
}

void test_beacon_state_change(void)
{
    mesh_config_entry_id_t entry_id = MESH_OPT_CORE_SEC_NWK_BCN_EID;
    bool get_state;
    bool set_state;

    TEST_ASSERT_NOT_NULL(m_net_beacon_enable_params.callbacks.getter);
    TEST_ASSERT_NOT_NULL(m_net_beacon_enable_params.callbacks.setter);
    TEST_ASSERT_NULL(m_net_beacon_enable_params.callbacks.deleter);

    setup_module();
    m_net_beacon_enable_params.callbacks.getter(entry_id, &get_state);
    TEST_ASSERT_EQUAL(true, get_state);

    /* Enable the beacon while already enabled: */
    set_state = true;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, m_net_beacon_enable_params.callbacks.setter(entry_id, &set_state));
    m_net_beacon_enable_params.callbacks.getter(entry_id, &get_state);
    TEST_ASSERT_EQUAL(true, get_state);

    /* Disable the beacon while running: */
    timer_sch_abort_Expect(NULL);
    timer_sch_abort_IgnoreArg_p_timer_evt();
    set_state = false;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, m_net_beacon_enable_params.callbacks.setter(entry_id, &set_state));
    m_net_beacon_enable_params.callbacks.getter(entry_id, &get_state);
    TEST_ASSERT_EQUAL(false, get_state);

    /* Disable the beacon while already disabled: */
    set_state = false;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, m_net_beacon_enable_params.callbacks.setter(entry_id, &set_state));
    m_net_beacon_enable_params.callbacks.getter(entry_id, &get_state);
    TEST_ASSERT_EQUAL(false, get_state);

    /* Enable the beacon while disabled: */
    timer_now_ExpectAndReturn(1000);
    timer_sch_reschedule_Expect(NULL, 0);
    timer_sch_reschedule_IgnoreArg_p_timer_evt();
    timer_sch_reschedule_IgnoreArg_new_timestamp();
    set_state = true;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, m_net_beacon_enable_params.callbacks.setter(entry_id, &set_state));
    m_net_beacon_enable_params.callbacks.getter(entry_id, &get_state);
    TEST_ASSERT_EQUAL(true, get_state);

    /* Check high level interface */
    mesh_config_entry_set_ExpectAndReturn(MESH_OPT_CORE_SEC_NWK_BCN_EID, NULL, NRF_SUCCESS);
    mesh_config_entry_set_IgnoreArg_p_entry();
    net_beacon_state_set(true);

    bool retval = true;
    mesh_config_entry_get_ExpectAndReturn(MESH_OPT_CORE_SEC_NWK_BCN_EID, NULL, NRF_SUCCESS);
    mesh_config_entry_get_IgnoreArg_p_entry();
    mesh_config_entry_get_ReturnThruPtr_p_entry(&retval);
    TEST_ASSERT_EQUAL(true, net_beacon_state_get());
}

/**
 * Test that receiving beacons for a specific network slows down the retransmit rate
 */
void test_redundant_tx(void)
{
    setup_module();

    net_beacon_sample_data_t sample_datas[] = {SEC_NET_SAMPLE_DATA_1, SEC_NET_SAMPLE_DATA_2, SEC_NET_SAMPLE_DATA_3};
    for (uint32_t i = 0; i < ARRAY_SIZE(sample_datas); i++)
    {
        nrf_mesh_beacon_tx_info_t tx_info;
        net_beacon_sample_data_t sample_data = sample_datas[i];
        memset(&tx_info, 0, sizeof(tx_info));
        sample_data.info.p_tx_info = &tx_info;

        nrf_mesh_beacon_info_t * p_info[] = {&sample_data.info};
        mpp_infos = p_info;
        m_info_count = 1;
        adv_packet_t adv_packet;

        /* transmit a beacon on the first timeout. */
        m_time_now = SEC_TO_US(10);
        m_info_index = 0;

        /* Call the timeout */
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        expect_tx(sample_data.info.secmat.key, sample_data.beacon, sample_data.auth, &adv_packet);
        m_timer_cb(m_time_now, NULL);
        tx_complete();
        TEST_ASSERT_EQUAL(m_time_now, sample_data.info.p_tx_info->tx_timestamp); // should be reset on each transmit.

        /* Observe one beacon this interval, don't expect it to fire: */
        sample_data.info.p_tx_info->rx_count[0] = 1;
        m_time_now += SEC_TO_US(10);
        m_info_index = 0;
        m_timer_cb(m_time_now, NULL);

        /* Don't observe any beacons this interval, dropping the number of observed beacons to 0.5/interval, triggering a TX: */
        m_time_now += SEC_TO_US(10);
        m_info_index = 0;
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        expect_tx(sample_data.info.secmat.key, sample_data.beacon, sample_data.auth, &adv_packet);
        m_timer_cb(m_time_now, NULL);
        tx_complete();
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count[0]); // should be reset on each interval
        TEST_ASSERT_EQUAL(m_time_now, sample_data.info.p_tx_info->tx_timestamp); // should be reset on each transmit.

